//@ts-check
/**
 * @type {Array<{ pref : string , Subdivisions : Array<{ subdivistionName : string , areas : string[], n : number }> }>}
 */
export const SubDivisionAndCityNames = [
    {
        pref: "北海道",
        Subdivisions: [
            {
                subdivistionName: "石狩地方北部",
                areas: ["石狩市", "当別町", "新篠津村"],
                n: 1
            },
            {
                subdivistionName: "石狩地方中部",
                areas: ["札幌市", "江別市"],
                n: 2
            },
            {
                subdivistionName: "石狩地方南部",
                areas: ["千歳市", "恵庭市", "北広島市"],
                n: 3
            },
            {
                subdivistionName: "後志地方北部",
                areas: ["小樽市", "積丹町", "古平町", "仁木町", "余市町", "赤井川村"],
                n: 4
            },
            {
                subdivistionName: "後志地方東部",
                areas: ["ニセコ町", "真狩村", "留寿都村", "喜茂別町", "京極町", "倶知安町"],
                n: 5
            },
            {
                subdivistionName: "空知地方北部",
                areas: ["島牧村", "寿都町", "黒松内町", "蘭越町", "共和町", "岩内町", "泊村", "神恵内"],
                n: 6
            },
            {
                subdivistionName: "空知地方中部",
                areas: ["深川市", "妹背牛町", "秩父別町", "北竜町", "沼田町"],
                n: 7
            },
            {
                subdivistionName: "空知地方南部",
                areas: ["芦別市", "赤平市", "滝川市", "砂川市", "歌志内市", "奈井江町", "上砂川町", "浦臼町", "新十津川町", "雨竜町"],
                n: 8
            },
            {
                subdivistionName: "空知地方南部",
                areas: ["夕張市", "岩見沢市", "美唄市", "三笠市", "南幌町", "由仁町", "長沼町", "栗山町", "月形町"],
                n: 9
            },
            {
                subdivistionName: "渡島地方北部",
                areas: ["八雲町", "長万部町"],
                n: 10
            },
            {
                subdivistionName: "渡島地方東部",
                areas: ["函館市", "北斗市", "七飯町", "鹿部町", "森町"],
                n: 11
            },
            {
                subdivistionName: "渡島地方西部",
                areas: ["松前町", "福島町", "知内町", "木古内町"],
                n: 12
            },
            {
                subdivistionName: "檜山地方",
                areas: ["江差町", "上ノ国町", "厚沢部町", "乙部町", "今金町", "せたな町"],
                n: 13
            },
            {
                subdivistionName: "北海道奥尻島",
                areas: ["奥尻町"],
                n: 14
            },
            {
                subdivistionName: "胆振地方西部",
                areas: ["伊達市", "豊浦町", "洞爺湖町", "壮瞥町"],
                n: 15
            },
            {
                subdivistionName: "胆振地方中東部",
                areas: ["室蘭市", "苫小牧市", "登別市", "白老町", "安平町", "厚真町", "むかわ町"],
                n: 16
            },
            {
                subdivistionName: "日高地方西部",
                areas: ["日高町", "平取町"],
                n: 17
            },
            {
                subdivistionName: "日高地方中部",
                areas: ["新冠町", "新ひだか町"],
                n: 18
            },
            {
                subdivistionName: "日高地方東部",
                areas: ["浦河町", "様似町", "えりも町"],
                n: 19
            },
            {
                subdivistionName: "上川地方北部",
                areas: ["士別市", "名寄市", "和寒町", "剣淵町", "下川町", "美深町", "音威子府村", "中川町", "幌加内町"],
                n: 20
            },
            {
                subdivistionName: "上川地方中部",
                areas: ["旭川市", "鷹栖町", "東神楽町", "当麻町", "比布町", "愛別町", "上川町", "東川町", "美瑛町"],
                n: 21
            },
            {
                subdivistionName: "上川地方南部",
                areas: ["富良野市", "上富良野町", "中富良野町", "南富良野町", "占冠村"],
                n: 22
            },
            {
                subdivistionName: "留萌地方中北部",
                areas: ["苫前町", "羽幌町", "初山別村", "遠別町", "天塩町"],
                n: 23
            },
            {
                subdivistionName: "留萌地方南部",
                areas: ["留萌市", "増毛町", "小平町"],
                n: 24
            },
            {
                subdivistionName: "宗谷地方北部",
                areas: ["稚内市", "猿払村", "豊富町", "幌延町"],
                n: 25
            },
            {
                subdivistionName: "宗谷地方南部",
                areas: ["浜頓別町", "中頓別町", "枝幸町"],
                n: 26
            },
            {
                subdivistionName: "北海道利尻礼文",
                areas: ["礼文町", "利尻町", "利尻富士町"],
                n: 27
            },
            {
                subdivistionName: "網走地方",
                areas: ["網走市", "美幌町", "津別町", "大空町", "斜里町", "清里町", "小清水町"],
                n: 28
            },
            {
                subdivistionName: "北見地方",
                areas: ["北見市", "訓子府町", "置戸町", "佐呂間町"],
                n: 29
            },
            {
                subdivistionName: "紋別地方",
                areas: ["紋別市", "遠軽町", "湧別町", "滝上町", "興部町", "西興部村", "雄武町"],
                n: 30
            },
            {
                subdivistionName: "十勝地方北部",
                areas: ["上士幌町", "鹿追町", "新得町", "足寄町", "陸別町"],
                n: 31
            },
            {
                subdivistionName: "十勝地方中部",
                areas: ["帯広市", "音更町", "士幌町", "清水町", "芽室町", "幕別町", "池田町", "豊頃町", "本別町", "浦幌町"],
                n: 32
            },
            {
                subdivistionName: "十勝地方南部",
                areas: ["中札内村", "更別村", "大樹町", "広尾町"],
                n: 33
            },
            {
                subdivistionName: "釧路地方北部",
                areas: ["弟子屈町"],
                n: 34
            },
            {
                subdivistionName: "釧路地方中南部",
                areas: ["釧路市", "釧路町", "厚岸町", "浜中町", "標茶町", "鶴居村", "白糠町"],
                n: 35
            },
            {
                subdivistionName: "根室地方北部",
                areas: ["中標津町", "標津町", "羅臼町"],
                n: 36
            },
            {
                subdivistionName: "根室地方中部",
                areas: ["別海町"],
                n: 37
            },
            {
                subdivistionName: "根室地方南部",
                areas: ["根室市"],
                n: 38
            }
        ]
    },
    {
        pref: "青森県",
        Subdivisions: [
            {
                subdivistionName: "青森県津軽北部",
                areas: ["青森市", "五所川原市", "つがる市", "平内町", "今別町", "蓬田村", "外ヶ浜町", "板柳町", "鶴田町", "中泊町"],
                n: 39
            },
            {
                subdivistionName: "青森県津軽南部",
                areas: ["弘前市", "黒石市", "平川市", "鰺ヶ沢町", "深浦町", "西目屋村", "藤崎町", "大鰐町", "田舎館村"],
                n: 40
            },
            {
                subdivistionName: "青森県三八上北",
                areas: ["八戸市", "十和田市", "三沢市", "上北郡［野辺地町", "七戸町", "六戸町", "横浜町", "東北町", "六ヶ所村", "おいらせ町", "三戸町", "五戸町", "田子町", "南部町", "階上町", "新郷村"],
                n: 41
            },
            {
                subdivistionName: "青森県下北",
                areas: ["むつ市", "大間町", "東通村", "風間浦村", "佐井村"],
                n: 42
            }
        ]
    },
    {
        pref: "岩手県",
        Subdivisions: [
            {
                subdivistionName: "岩手県沿岸北部",
                areas: ["宮古市", "久慈市", "山田町", "岩泉町", "田野畑村", "普代村", "洋野町", "野田村"],
                n: 43
            },
            {
                subdivistionName: "岩手県沿岸南部",
                areas: ["大船渡市", "陸前高田市", "釜石市", "住田町", "大槌町"],
                n: 44
            },
            {
                subdivistionName: "岩手県内陸北部",
                areas: ["盛岡市", "二戸市", "八幡平市", "滝沢市", "雫石町", "葛巻町", "岩手町", "紫波町", "矢巾町", "軽米町", "九戸村", "一戸町"],
                n: 45
            },
            {
                subdivistionName: "岩手県内陸南部",
                areas: ["花巻市", "北上市", "遠野市", "一関市", "奥州市", "西和賀町", "金ケ崎町", "平泉町"],
                n: 46
            },
        ]
    },
    {
        pref: "宮城県",
        Subdivisions: [
            {
                subdivistionName: "宮城県北部",
                areas: ["気仙沼市", "登米市", "栗原市", "大崎市", "色麻町", "加美町", "涌谷町", "美里町", "南三陸町"],
                n: 47
            },
            {
                subdivistionName: "宮城県中部",
                areas: ["仙台市", "石巻市", "塩竈市", "多賀城市", "東松島市", "富谷市", "松島町", "七ヶ浜町", "利府町", "大和町", "大郷町", "大衡村", "女川町"],
                n: 48
            },
            {
                subdivistionName: "宮城県南部",
                areas: ["白石市", "名取市", "角田市", "岩沼市", "蔵王町", "七ヶ宿町", "大河原町", "村田町", "柴田町", "川崎町", "丸森町", "亘理町", "山元町"],
                n: 49
            }
        ]
    },
    {
        pref: "秋田県",
        Subdivisions: [
            {
                subdivistionName: "秋田県沿岸北部",
                areas: ["能代市", "男鹿市", "潟上市", "藤里町", "三種町", "八峰町", "五城目町", "八郎潟町", "井川町", "大潟村"],
                n: 50
            },
            {
                subdivistionName: "秋田県沿岸南部",
                areas: ["秋田市", "由利本荘市", "にかほ市"],
                n: 51
            },
            {
                subdivistionName: "秋田県内陸北部",
                areas: ["大館市", "鹿角市", "北秋田市", "小坂町", "上小阿仁村"],
                n: 52
            },
            {
                subdivistionName: "秋田県内陸南部",
                areas: ["横手市", "湯沢市", "大仙市", "仙北市", "美郷町", "羽後町", "東成瀬村"],
                n: 53
            }
        ]
    },
    {
        pref: "山形県",
        Subdivisions: [
            {
                subdivistionName: "山形県庄内",
                areas: ["鶴岡市", "酒田市", "三川町", "庄内町", "遊佐町"],
                n: 54
            },
            {
                subdivistionName: "山形県最上",
                areas: ["新庄市", "金山町", "最上町", "舟形町", "真室川町", "大蔵村", "鮭川村", "戸沢村"],
                n: 55
            },
            {
                subdivistionName: "山形県村山",
                areas: ["山形市", "寒河江市", "上山市", "村山市", "天童市", "東根市", "尾花沢市", "山辺町", "中山町", "河北町", "西川町", "朝日町", "大江町", "大石田町"],
                n: 56
            },
            {
                subdivistionName: "山形県置賜",
                areas: ["米沢市", "長井市", "南陽市", "高畠町", "川西町", "小国町", "白鷹町", "飯豊町"],
                n: 57
            }
        ]
    },
    {
        pref: "福島県",
        Subdivisions: [
            {
                subdivistionName: "福島県中通り",
                areas: ["福島市", "郡山市", "白河市", "須賀川市", "二本松市", "田村市", "伊達市", "本宮市", "伊達郡［桑折町", "国見町", "川俣町", "大玉村", "鏡石町", "天栄村", "西郷村", "泉崎村", "中島村", "矢吹町", "棚倉町", "矢祭町", "塙町", "鮫川村", "石川町", "玉川村", "平田村", "浅川町", "古殿町", "三春町", "小野町"],
                n: 58
            },
            {
                subdivistionName: "福島県浜通り",
                areas: ["いわき市", "相馬市", "南相馬市", "広野町", "楢葉町", "富岡町", "川内村", "大熊町", "双葉町", "浪江町", "葛尾村］", "新地町", "飯舘村"],
                n: 59
            },
            {
                subdivistionName: "福島県会津",
                areas: ["会津若松市", "喜多方市", "下郷町", "檜枝岐村", "只見町", "南会津町", "北塩原村", "西会津町", "磐梯町", "猪苗代町", "会津坂下町", "湯川村", "柳津町", "三島町", "金山町", "昭和村", "会津美里町"],
                n: 60
            }
        ]
    },
    {
        pref: "茨城県",
        Subdivisions: [
            {
                subdivistionName: "茨城県北部",
                areas: ["水戸市", "日立市", "常陸太田市", "高萩市", "北茨城市", "笠間市", "ひたちなか市", "常陸大宮市", "那珂市", "小美玉市", "茨城町", "大洗町", "城里町", "東海村", "大子町"],
                n: 61
            },
            {
                subdivistionName: "茨城県南部",
                areas: ["土浦市", "古河市", "石岡市", "結城市", "龍ケ崎市", "下妻市", "常総市", "取手市", "牛久市", "つくば市", "鹿嶋市", "潮来市", "守谷市", "筑西市", "坂東市", "稲敷市", "かすみがうら市", "桜川市", "神栖市", "行方市", "鉾田市", "つくばみらい市", "稲敷郡［美浦村", "阿見町", "河内町", "八千代町", "五霞町", "境町", "利根町"],
                n: 62
            }
        ]
    },
    {
        pref: "栃木県",
        Subdivisions: [
            {
                subdivistionName: "栃木県北部",
                areas: ["日光市", "大田原市", "矢板市", "那須塩原市", "塩谷町", "那須町"],
                n: 63
            },
            {
                subdivistionName: "栃木県南部",
                areas: ["宇都宮市", "足利市", "栃木市", "佐野市", "鹿沼市", "小山市", "真岡市", "さくら市", "那須烏山市", "下野市", "上三川町", "益子町", "茂木町", "市貝町", "芳賀町", "壬生町", "野木町", "高根沢町", "那珂川町"],
                n: 64
            }
        ]
    },
    {
        pref: "群馬県",
        Subdivisions: [
            {
                subdivistionName: "群馬県北部",
                areas: ["沼田市", "中之条町", "長野原町", "嬬恋村", "草津町", "高山村", "東吾妻町", "片品村", "川場村", "昭和村", "みなかみ町"],
                n: 65
            },
            {
                subdivistionName: "群馬県南部",
                areas: ["前橋市", "高崎市", "桐生市", "伊勢崎市", "太田市", "館林市", "渋川市", "藤岡市", "富岡市", "安中市", "みどり市", "榛東村", "吉岡町", "上野村", "神流町", "下仁田町", "南牧村", "甘楽町", "玉村町", "板倉町", "明和町", "千代田町", "大泉町", "邑楽町"],
                n: 66
            }
        ]
    },
    {
        pref: "埼玉県",
        Subdivisions: [
            {
                subdivistionName: "埼玉県北部",
                areas: ["熊谷市", "行田市", "加須市", "本庄市", "東松山市", "羽生市", "鴻巣市", "深谷市", "久喜市", "滑川町", "嵐山町", "小川町", "ときがわ町", "吉見町", "鳩山町", "東秩父村", "美里町", "神川町", "上里町", "寄居町"],
                n: 67
            },
            {
                subdivistionName: "埼玉県南部",
                areas: ["さいたま市", "川越市", "川口市", "所沢市", "飯能市", "春日部市", "狭山市", "上尾市", "草加市", "越谷市", "蕨市", "戸田市", "入間市", "朝霞市", "志木市", "和光市", "新座市", "桶川市", "北本市", "八潮市", "富士見市", "三郷市", "蓮田市", "坂戸市", "幸手市", "鶴ヶ島市", "日高市", "吉川市", "ふじみ野市", "白岡市", "伊奈町", "三芳町", "毛呂山町", "越生町", "川島町", "宮代町", "杉戸町", "松伏町"],
                n: 68
            },
            {
                subdivistionName: "埼玉県秩父",
                areas: ["秩父市", "横瀬町", "皆野町", "長瀞町", "小鹿野町"],
                n: 69
            }
        ]
    },
    {
        pref: "千葉県",
        Subdivisions: [
            {
                subdivistionName: "千葉県北東部",
                areas: ["銚子市", "茂原市", "東金市", "旭市", "匝瑳市", "香取市", "山武市", "大網白里市", "神崎町", "多古町", "東庄町", "九十九里町", "芝山町", "横芝光町", "一宮町", "睦沢町", "長生村", "白子町", "長柄町", "長南町"],
                n: 70
            },
            {
                subdivistionName: "千葉県北西部",
                areas: ["千葉市", "市川市", "船橋市", "松戸市", "野田市", "成田市", "佐倉市", "習志野市", "柏市", "市原市", "流山市", "八千代市", "我孫子市", "鎌ケ谷市", "浦安市", "四街道市", "八街市", "印西市", "白井市", "富里市", "酒々井町", "栄町"],
                n: 71
            },
            {
                subdivistionName: "千葉県南部",
                areas: ["館山市", "木更津市", "勝浦市", "鴨川市", "君津市", "富津市", "袖ケ浦市", "南房総市", "いすみ市", "大多喜町", "御宿町", "鋸南町"],
                n: 72
            }
        ]
    },
    {
        pref: "東京都",
        Subdivisions: [
            {
                subdivistionName: "東京都２３区",
                areas: ["千代田区", "中央区", "港区", "新宿区", "文京区", "台東区", "墨田区", "江東区", "品川区", "目黒区", "大田区", "世田谷区", "渋谷区", "中野区", "杉並区", "豊島区", "北区", "荒川区", "板橋区", "練馬区", "足立区", "葛飾区", "江戸川区"],
                n: 73
            },
            {
                subdivistionName: "東京都多摩東部",
                areas: ["八王子市", "立川市", "武蔵野市", "三鷹市", "府中市", "昭島市", "調布市", "町田市", "小金井市", "小平市", "日野市", "東村山市", "国分寺市", "国立市", "福生市", "狛江市", "東大和市", "清瀬市", "東久留米市", "武蔵村山市", "多摩市", "稲城市", "羽村市", "西東京市", "瑞穂町"],
                n: 74
            },
            {
                subdivistionName: "東京都多摩西部",
                areas: ["青梅市", "あきる野市", "日の出町", "檜原村", "奥多摩町"],
                n: 75
            },
            {
                subdivistionName: "伊豆大島",
                areas: ["大島町"],
                n: 76
            },
            {
                subdivistionName: "新島",
                areas: ["利島村", "新島村"],
                n: 77
            },
            {
                subdivistionName: "神津島",
                areas: ["神津島村"],
                n: 78
            },
            {
                subdivistionName: "三宅島",
                areas: ["三宅村", "御蔵島村"],
                n: 79
            },
            {
                subdivistionName: "八丈島",
                areas: ["八丈町", "青ヶ島村"],
                n: 80
            },
            {
                subdivistionName: "小笠原",
                areas: ["小笠原村"],
                n: 81
            }
        ]
    },
    {
        pref: "神奈川県",
        Subdivisions: [
            {
                subdivistionName: "神奈川県東部",
                areas: ["横浜市", "川崎市", "横須賀市", "平塚市", "鎌倉市", "藤沢市", "茅ヶ崎市", "逗子市", "三浦市", "大和市", "海老名市", "座間市", "綾瀬市", "葉山町", "寒川町", "大磯町", "二宮町"],
                n: 82
            },
            {
                subdivistionName: "神奈川県西部",
                areas: ["小田原市", "相模原市", "秦野市", "厚木市", "伊勢原市", "南足柄市", "中井町", "大井町", "松田町", "山北町", "開成町", "箱根町", "真鶴町", "湯河原町", "愛川町", "清川村"],
                n: 83
            }
        ]
    },
    {
        pref: "新潟県",
        Subdivisions: [
            {
                subdivistionName: "新潟県上越",
                areas: ["糸魚川市", "妙高市", "上越市"],
                n: 84
            },
            {
                subdivistionName: "新潟県中越",
                areas: ["長岡市", "三条市", "柏崎市", "小千谷市", "加茂市", "十日町市", "見附市", "魚沼市", "南魚沼市", "田上町", "出雲崎町", "湯沢町", "津南町", "刈羽村"],
                n: 85
            },
            {
                subdivistionName: "新潟県下越",
                areas: ["新潟市", "新発田市", "村上市", "燕市", "五泉市", "阿賀野市", "胎内市", "聖籠町", "弥彦村", "阿賀町", "関川村", "粟島浦村"],
                n: 86
            },
            {
                subdivistionName: "新潟県佐渡",
                areas: ["佐渡市"],
                n: 87
            }
        ]
    },
    {
        pref: "富山県",
        Subdivisions: [
            {
                subdivistionName: "富山県東部",
                areas: ["富山市", "魚津市", "滑川市", "黒部市", "舟橋村", "上市町", "立山町", "入善町", "朝日町"],
                n: 88
            },
            {
                subdivistionName: "富山県西部",
                areas: ["高岡市", "氷見市", "砺波市", "小矢部市", "南砺市", "射水市"],
                n: 89
            }
        ]
    },
    {
        pref: "石川県",
        Subdivisions: [
            {
                subdivistionName: "石川県能登",
                areas: ["七尾市", "輪島市", "珠洲市", "羽咋市", "志賀町", "宝達志水町", "中能登町", "穴水町", "能登町"],
                n: 90
            },
            {
                subdivistionName: "石川県加賀",
                areas: ["金沢市", "小松市", "加賀市", "かほく市", "白山市", "能美市", "野々市市", "川北町", "津幡町", "内灘町"],
                n: 91
            }
        ]
    },
    {
        pref: "福井県",
        Subdivisions: [
            {
                subdivistionName: "福井県嶺北",
                areas: ["福井市", "大野市", "勝山市", "鯖江市", "あわら市", "越前市", "坂井市", "永平寺町", "池田町", "南越前町", "越前町"],
                n: 92
            },
            {
                subdivistionName: "福井県嶺南",
                areas: ["敦賀市", "小浜市", "美浜町", "高浜町", "おおい町", "若狭町"],
                n: 93
            }
        ]
    },
    {
        pref: "山梨県",
        Subdivisions: [
            {
                subdivistionName: "山梨県東部・富士五湖",
                areas: ["富士吉田市", "都留市", "大月市", "上野原市", "道志村", "西桂町", "忍野村", "山中湖村", "鳴沢村", "富士河口湖町", "小菅村", "丹波山村"],
                n: 94
            },
            {
                subdivistionName: "山梨県中・西部",
                areas: ["甲府市", "山梨市", "韮崎市", "南アルプス市", "北杜市", "甲斐市", "笛吹市", "甲州市", "中央市", "市川三郷町", "早川町", "身延町", "南部町", "富士川町", "昭和町"],
                n: 95
            }
        ]
    },
    {
        pref: "長野県",
        Subdivisions: [
            {
                subdivistionName: "長野県北部",
                areas: ["長野市", "須坂市", "中野市", "大町市", "飯山市", "千曲市", "池田町", "松川村", "白馬村", "小谷村", "坂城町", "小布施町", "高山村", "山ノ内町", "木島平村", "野沢温泉村", "信濃町", "小川村", "飯綱町", "栄村"],
                n: 96
            },
            {
                subdivistionName: "長野県中部",
                areas: ["松本市", "上田市", "岡谷市", "諏訪市", "小諸市", "茅野市", "塩尻市", "佐久市", "東御市", "安曇野市", "小海町", "川上村", "南牧村", "南相木村", "北相木村", "佐久穂町", "軽井沢町", "御代田町", "立科町", "青木村", "長和町", "下諏訪町", "富士見町", "原村", "麻績村", "生坂村", "山形村", "朝日村", "筑北村"],
                n: 97
            },
            {
                subdivistionName: "長野県南部",
                areas: ["飯田市", "伊那市", "駒ヶ根市", "辰野町", "箕輪町", "飯島町", "南箕輪村", "中川村", "宮田村", "松川町", "高森町", "阿南町", "阿智村", "平谷村", "根羽村", "下條村", "売木村", "天龍村", "泰阜村", "喬木村", "豊丘村", "大鹿村", "上松町", "南木曽町", "木祖村", "王滝村", "大桑村", "木曽町"],
                n: 98
            }
        ]
    },
    {
        pref: "岐阜県",
        Subdivisions: [
            {
                subdivistionName: "岐阜県飛騨",
                areas: ["高山市", "飛騨市", "下呂市", "白川村"],
                n: 99
            },
            {
                subdivistionName: "岐阜県美濃東部",
                areas: ["多治見市", "中津川市", "瑞浪市", "恵那市", "美濃加茂市", "土岐市", "可児市", "坂祝町", "富加町", "川辺町", "七宗町", "八百津町", "白川町", "東白川村", "御嵩町"],
                n: 100
            },
            {
                subdivistionName: "岐阜県美濃中西部",
                areas: ["岐阜市", "大垣市", "関市", "美濃市", "羽島市", "各務原市", "山県市", "瑞穂市", "本巣市", "郡上市", "海津市", "岐南町", "笠松町", "養老町", "垂井町", "関ケ原町", "神戸町", "輪之内町", "安八町", "揖斐川町", "大野町", "池田町", "北方町"],
                n: 101
            }
        ]
    },
    {
        pref: "静岡県",
        Subdivisions: [
            {
                subdivistionName: "静岡県伊豆",
                areas: ["熱海市", "伊東市", "下田市", "伊豆市", "伊豆の国市", "東伊豆町", "河津町", "南伊豆町", "松崎町", "西伊豆町", "函南町"],
                n: 102
            },
            {
                subdivistionName: "静岡県東部",
                areas: ["沼津市", "三島市", "富士宮市", "富士市", "御殿場市", "裾野市", "清水町", "長泉町", "小山町"],
                n: 103
            },
            {
                subdivistionName: "静岡県中部",
                areas: ["静岡市", "島田市", "焼津市", "藤枝市", "牧之原市", "吉田町", "川根本町"],
                n: 104
            },
            {
                subdivistionName: "静岡県西部",
                areas: ["浜松市", "磐田市", "掛川市", "袋井市", "湖西市", "御前崎市", "菊川市", "森町"],
                n: 105
            }
        ]
    },
    {
        pref: "愛知県",
        Subdivisions: [
            {
                subdivistionName: "愛知県東部",
                areas: ["豊橋市", "豊川市", "蒲郡市", "新城市", "田原市", "設楽町", "東栄町", "豊根村"],
                n: 106
            },
            {
                subdivistionName: "愛知県西部",
                areas: ["名古屋市", "岡崎市", "一宮市", "瀬戸市", "半田市", "春日井市", "津島市", "碧南市", "刈谷市", "豊田市", "安城市", "西尾市", "犬山市", "常滑市", "江南市", "小牧市", "稲沢市", "東海市", "大府市", "知多市", "知立市", "尾張旭市", "高浜市", "岩倉市", "豊明市", "日進市", "愛西市", "清須市", "北名古屋市", "弥富市", "みよし市", "あま市", "長久手市", "東郷町", "西豊山町", "大口町", "扶桑町", "大治町", "蟹江町", "飛島村", "阿久比町", "東浦町", "南知多町", "美浜町", "武豊町", "幸田町"],
                n: 107
            }
        ]
    },
    {
        pref: "三重県",
        Subdivisions: [
            {
                subdivistionName: "三重県北部",
                areas: ["四日市市", "桑名市", "鈴鹿市", "亀山市", "いなべ市", "木曽岬町", "東員町", "菰野町", "朝日町", "川越町"],
                n: 108
            },
            {
                subdivistionName: "三重県中部",
                areas: ["津市", "松阪市", "名張市", "伊賀市", "多気町", "明和町"],
                n: 109
            },
            {
                subdivistionName: "三重県南部",
                areas: ["伊勢市", "尾鷲市", "鳥羽市", "熊野市", "志摩市", "大台町", "玉城町", "度会町", "大紀町", "南伊勢町", "紀北町", "御浜町", "紀宝町"],
                n: 110
            }
        ]
    },
    {
        pref: "滋賀県",
        Subdivisions: [
            {
                subdivistionName: "滋賀県北部",
                areas: ["彦根市", "長浜市", "高島市", "米原市", "愛荘町", "豊郷町", "甲良町", "多賀町"],
                n: 111
            },
            {
                subdivistionName: "滋賀県南部",
                areas: ["大津市", "近江八幡市", "草津市", "守山市", "栗東市", "甲賀市", "野洲市", "湖南市", "東近江市", "日野町", "竜王町"],
                n: 112
            }
        ]
    },
    {
        pref : "京都府",
        Subdivisions : [
            {
                subdivistionName : "京都府北部",
                areas : ["福知山市","舞鶴市","綾部市","宮津市","京丹後市","伊根町","与謝野町"],
                n : 113
            },
            {
                subdivistionName : "京都府南部",
                areas : ["京都北区","京都上京区","京都左京区","京都中京区","京都東山区","京都下京区","京都南区","京都右京区","京都伏見区","京都山科区","京都西京区","宇治市","亀岡市","城陽市","向日市","長岡京市","八幡市","京田辺市","南丹市","木津川市","大山崎町","久御山町","井手町","宇治田原町","笠置町","和束町","精華町","南山城村","京丹波町"],
                n : 114
            }
        ]
    },
    {
        pref : "大阪府",
        Subdivisions  : [
            {
                subdivistionName : "大阪府北部",
                areas : ["大阪都島区","大阪福島区","大阪此花区","大阪西区","大阪港区","大阪大正区","大阪天王寺区","大阪浪速区","大阪西淀川区","大阪東淀川区","大阪東成区","大阪生野区","大阪旭区","大阪城東区","大阪阿倍野区","大阪住吉区","大阪東住吉区","大阪西成区","大阪淀川区","大阪鶴見区","大阪住之江区","大阪平野区","大阪北区","大阪中央区","豊中市","池田市","吹田市","高槻市","守口市","枚方市","茨木市","八尾市","寝屋川市","大東市","箕面市","柏原市","門真市","摂津市","東大阪市","四條畷市","交野市","島本町","豊能町","能勢町"],
                n : 115
            },
            {
                subdivistionName : "大阪府南部",
                areas : ["大阪堺市堺区","大阪堺市中区","大阪堺市東区","大阪堺市西区","大阪堺市南区","大阪堺市北区","大阪堺市美原区","岸和田市","泉大津市","貝塚市","泉佐野市","富田林市","河内長野市","松原市","大阪和泉市","羽曳野市","高石市","藤井寺市","泉南市","大阪狭山市","阪南市","忠岡町","熊取町","田尻町","大阪岬町","大阪太子町","河南町","千早赤阪村"],
                n : 116
            }
        ]
    },
    {
        pref : "兵庫県",
        Subdivisions : [
            {
                subdivistionName : "兵庫県北部",
                areas : ["豊岡市","養父市","朝来市","兵庫香美町","新温泉町"],
                n : 117
            },
            {
                subdivistionName : "兵庫県南東部",
                areas : ["神戸東灘区","神戸灘区","神戸兵庫区","神戸長田区","神戸須磨区","神戸垂水区","神戸北区","神戸中央区","神戸西区","尼崎市","明石市","西宮市","芦屋市","伊丹市","加古川市","西脇市","宝塚市","三木市","高砂市","川西市","小野市","三田市","加西市","丹波篠山市","丹波市","加東市","猪名川町","多可町","兵庫稲美町","播磨町"],
                n : 118
            },
            {
                subdivistionName : "兵庫県南西部",
                areas : ["姫路市","相生市","赤穂市","宍粟市","たつの市","市川町","福崎町","兵庫神河町","兵庫太子町","上郡町","佐用町"],
                n : 119
            },
            {
                subdivistionName : "兵庫県淡路島",
                areas : ["洲本市","南あわじ市","淡路市"],
                n : 120
            }
        ]
    },
    {
        pref : "奈良県",
        Subdivisions : [
            {
                subdivistionName : "奈良県",
                areas : ["奈良市","大和高田市","大和郡山市","天理市","橿原市","桜井市","五條市","御所市","生駒市","香芝市","葛城市","宇陀市","山添村","平群町","三郷町","斑鳩町","安堵町","奈良川西町","三宅町","田原本町","曽爾村","御杖村","高取町","明日香村","上牧町","王寺町","広陵町","河合町","吉野町","大淀町","下市町","黒滝村","天川村","野迫川村","十津川村","下北山村","上北山村","奈良川上村","東吉野村"],
                n : 121
            }
        ]
    },
    {
        pref : "和歌山県",
        Subdivisions : [
            {
                subdivistionName : "和歌山県北部",
                areas : ["和歌山市","海南市","橋本市","有田市","御坊市","紀の川市","岩出市","紀美野町","かつらぎ町","九度山町","高野町","湯浅町","和歌山広川町","有田川町","和歌山美浜町","和歌山日高町","由良町","和歌山印南町","みなべ町","日高川町"],
                n : 122
            },
            {
                subdivistionName : "和歌山県南部",
                areas : ["田辺市","新宮市","白浜町","上富田町","すさみ町","那智勝浦町","太地町","古座川町","北山村","串本町"],
                n : 123
            }
        ]
    },
    {
        pref : "鳥取県",
        Subdivisions : [
            {
                subdivistionName : "鳥取県東部",
                areas : ["鳥取市","岩美町","鳥取若桜町","智頭町","八頭町"],
                n : 124
            },
            {
                subdivistionName : "鳥取県中部",
                areas : ["倉吉市","三朝町","湯梨浜町","琴浦町","北栄町"],
                n : 125
            },
            {
                subdivistionName : "鳥取県西部",
                areas : ["米子市","境港市","日吉津村","大山町","鳥取南部町","伯耆町","日南町","鳥取日野町","江府町"],
                n : 126
            }
        ]
    },
    {
        pref : "島根県",
        Subdivisions : [
            {
                subdivistionName : "島根県東部",
                areas : ["松江市","出雲市","安来市","雲南市","奥出雲町","飯南町"],
                n : 127
            },
            {
                subdivistionName : "島根県西部",
                areas : ["浜田市","益田市","大田市","江津市","川本町","島根美郷町","邑南町","津和野町","吉賀町"],
                n : 128
            },
            {
                subdivistionName : "島根県隠岐",
                areas : ["海士町","西ノ島町","知夫村","隠岐の島町"],
                n : 129
            }
        ]
    },
    {
        pref : "岡山県",
        Subdivisions : [
            {
                subdivistionName : "岡山県北部",
                areas : ["津山市","新見市","真庭市","美作市","新庄村","鏡野町","勝央町","奈義町","西粟倉村","久米南町","岡山美咲町"],
                n : 130
            },
            {
                subdivistionName : "岡山県南部",
                areas : ["岡山北区","岡山中区","岡山東区","岡山南区","倉敷市","玉野市","笠岡市","井原市","総社市","高梁市","備前市","瀬戸内市","赤磐市","浅口市","和気町","早島町","里庄町","矢掛町","吉備中央町"],
                n : 131
            }
        ]
    },
    {
        pref : "広島県",
        Subdivisions : [
            {
                subdivistionName : "広島県北部",
                areas : ["広島三次市","庄原市","安芸高田市","安芸太田町","北広島町"],
                n : 132
            },
            {
                subdivistionName : "広島県南東部",
                areas : ["三原市","尾道市","福山市","広島府中市","世羅町","神石高原町"],
                n : 133
            },
            {
                subdivistionName : "広島県南西部",
                areas : ["広島中区","広島東区","広島南区","広島西区","広島安佐南区","広島安佐北区","広島安芸区","広島佐伯区","呉市","竹原市","大竹市","東広島市","廿日市市","江田島市","府中町","海田町","熊野町","坂町","大崎上島町"],
                n : 134
            }
        ]
    },
    {
        pref : "徳島県",
        Subdivisions : [
            {
                subdivistionName : "徳島県北部",
                areas : ["徳島市","鳴門市","小松島市","吉野川市","阿波市","美馬市","徳島三好市","佐那河内村","石井町","神山町","松茂町","北島町","藍住町","板野町","上板町","つるぎ町","東みよし町"],
                n : 135
            },
            {
                subdivistionName : "徳島県南部",
                areas : ["阿南市","勝浦町","上勝町","那賀町","牟岐町","美波町","海陽町"],
                n : 136
            }
        ]
    },
    {
        pref : "香川県",
        Subdivisions : [
            {
                subdivistionName :"香川県東部",
                areas : ["高松市","さぬき市","東かがわ市","土庄町","小豆島町","三木町","直島町"],
                n : 137
            },
            {
                subdivistionName : "香川県西部",
                areas :["丸亀市","坂出市","善通寺市","観音寺市","三豊市","宇多津町","綾川町","琴平町","多度津町","まんのう町"],
                n : 138
            }
        ]
    },
    {
        pref : "愛媛県",
        Subdivisions : [
            {
                subdivistionName : "愛媛県東予",
                areas : ["今治市","新居浜市","西条市","四国中央市","上島町"],
                n : 139
            },
            {
                subdivistionName : "愛媛県中予",
                areas : ["松山市","伊予市","東温市","久万高原町","愛媛松前町","砥部町"],
                n : 140
            },
            {
                subdivistionName : "愛媛県南予",
                areas : ["宇和島市","八幡浜市","大洲市","西予市","内子町","伊方町","松野町","愛媛鬼北町","愛南町"],
                n : 141
            }
        ]
    },
    {
        pref : "高知県",
        Subdivisions : [
            {
                subdivistionName : "高知県東部",
                areas : ["室戸市","安芸市","東洋町","奈半利町","田野町","安田町","北川村","馬路村","芸西村"],
                n : 142
            },
            {
                subdivistionName : "高知県中部",
                areas : ["高知市","南国市","土佐市","須崎市","香南市","香美市","本山町","大豊町","土佐町","大川村","いの町","仁淀川町","佐川町","越知町","日高村"],
                n : 143
            },
            {
                subdivistionName : "高知県西部",
                areas : ["宿毛市","土佐清水市","四万十市","中土佐町","梼原町","高知津野町","四万十町","大月町","三原村","黒潮町"],
                n : 144
            }
        ]
    },
    {
        pref : "山口県",
        Subdivisions : [
            {
                subdivistionName : "山口県北部",
                areas : ["萩市","長門市","美祢市","阿武町"],
                n : 145
            },
            {
                subdivistionName : "山口県西部",
                areas : ["下関市","宇部市","山陽小野田市"],
                n : 146
            },
            {
                subdivistionName : "山口県東部",
                areas : ["岩国市","光市","柳井市","周防大島町","和木町","上関町","田布施町","平生町"],
                n : 147
            },
            {
                subdivistionName : "山口県中部",
                areas : ["山口市","防府市","下松市","周南市"],
                n : 148
            }
        ]
    },
    {
        pref : "福岡県",
        Subdivisions : [
            {
                subdivistionName : "福岡県福岡",
                areas: ["福岡東区","福岡博多区","福岡中央区","福岡南区","福岡西区","福岡城南区","福岡早良区","筑紫野市","春日市","大野城市","宗像市","太宰府市","福岡古賀市","福津市","糸島市","那珂川市","宇美町","篠栗町","志免町","須恵町","新宮町","久山町","粕屋町"],
                n : 149
            },
            {
                subdivistionName : "福岡県北九州",
                areas: ["北九州門司区","北九州若松区","北九州戸畑区","北九州小倉北区","北九州小倉南区","北九州八幡東区","北九州八幡西区","行橋市","豊前市","中間市","芦屋町","水巻町","岡垣町","遠賀町","苅田町","みやこ町","吉富町","上毛町","築上町"],
                n : 150
            },
            {
                subdivistionName : "福岡県筑豊",
                areas : ["直方市","飯塚市","田川市","宮若市","嘉麻市","小竹町","鞍手町","桂川町","香春町","添田町","糸田町","福岡川崎町","大任町","赤村","福智町"],
                n : 151
            },
            {
                subdivistionName : "福岡県筑後",
                areas : ["大牟田市","久留米市","柳川市","八女市","筑後市","大川市","小郡市","うきは市","朝倉市","みやま市","筑前町","東峰村","大刀洗町","大木町","福岡広川町"],
                n : 152
            }
        ]
    },
    {
        pref : "佐賀県",
        Subdivisions : [
            {
                subdivistionName : "佐賀県北部",
                areas : ["唐津市","伊万里市","玄海町","有田町"],
                n : 153
            },
            {
                subdivistionName : "佐賀県南部",
                areas : ["佐賀市","鳥栖市","多久市","武雄市","佐賀鹿島市","小城市","嬉野市","神埼市","吉野ヶ里町","基山町","上峰町","みやき町","大町町","江北町","白石町","太良町"],
                n : 154
            }
        ]
    },
    {
        pref : "長崎県",
        Subdivisions : [
            {
                subdivistionName : "長崎県北部",
                areas : ["佐世保市","平戸市","松浦市","東彼杵町","川棚町","波佐見町","佐々町"],
                n : 155
            },
            {
                subdivistionName : "長崎県南西部",
                areas: ["長崎市","諫早市","大村市","西海市","長与町","時津町"],
                n : 156
            },
            {
                subdivistionName : "長崎県島原半島",
                areas : ["島原市","雲仙市","南島原市"],
                n : 157
            },
            {
                subdivistionName : "長崎県対馬",
                areas : ["対馬市"],
                n : 158
            },
            {
                subdivistionName : "長崎県壱岐",
                areas : ["壱岐市"],
                n : 159
            },
            {
                subdivistionName : "長崎県五島",
                areas : ["佐世保市宇久島","五島市","小値賀町","新上五島町"],
                n : 160
            }
        ]
    },
    {
        pref : "熊本県",
        Subdivisions : [
            {
                subdivistionName :"熊本県阿蘇",
                areas : ["阿蘇市","南小国町","熊本小国町","産山村","熊本高森町","南阿蘇村"],
                n : 161
            },
            {
                subdivistionName : "熊本県熊本",
                areas : ["熊本中央区","熊本東区","熊本西区","熊本南区","熊本北区","八代市","荒尾市","玉名市","山鹿市","菊池市","宇土市","宇城市","合志市","熊本美里町","玉東町","南関町","長洲町","和水町","大津町","菊陽町","西原村","御船町","嘉島町","益城町","甲佐町","山都町","氷川町"],
                n : 162
            },
            {
                subdivistionName : "熊本県球磨",
                areas : ["人吉市","錦町","多良木町","湯前町","水上村","相良村","五木村","山江村","球磨村","あさぎり町"],
                n : 163
            },
            {
                subdivistionName : "熊本県天草・芦北",
                areas : ["水俣市","上天草市","天草市","芦北町","津奈木町","苓北町"],
                n : 164
            }
        ]
    },
    {
        pref : "大分県",
        Subdivisions : [
            {
                subdivistionName :"大分県北部",
                areas : ["中津市","豊後高田市","宇佐市","国東市","姫島村"],
                n : 165
            },
            {
                subdivistionName : "大分県中部",
                areas : ["大分市","別府市","臼杵市","津久見市","杵築市","由布市","日出町"],
                n : 166
            },
            {
                subdivistionName : "大分県南部",
                areas : ["佐伯市","豊後大野市"],
                n : 167
            },
            {
                subdivistionName : "大分県西部",
                areas : ["日田市","竹田市","九重町","玖珠町"],
                n : 168
            }
        ]
    },
    {
        pref : "宮崎県",
        Subdivisions : [
            {
                subdivistionName : "宮崎県北部平野部",
                areas : ["延岡市","日向市","西都市","高鍋町","新富町","木城町","川南町","宮崎都農町","門川町"],
                n : 169
            },
            {
                subdivistionName : "宮崎県北部山沿い",
                areas : ["西米良村","諸塚村","椎葉村","宮崎美郷町","高千穂町","日之影町","五ヶ瀬町"],
                n : 170
            },
            {
                subdivistionName : "宮崎県南部平野部",
                areas : ["宮崎市","日南市","串間市","国富町","綾町"],
                n : 171
            },
            {
                subdivistionName : "宮崎県南部山沿い",
                areas : ["都城市","小林市","えびの市","三股町","高原町"],
                n : 172
            }
        ]
    },
    {
        pref : "鹿児島県",
        Subdivisions : [
            {
                subdivistionName : "鹿児島県薩摩",
                areas : ["鹿児島市","枕崎市","阿久根市","鹿児島出水市","指宿市","薩摩川内市","日置市","霧島市","いちき串木野市","南さつま市","南九州市","伊佐市","姶良市","さつま町","長島町","湧水町"],
                n : 173
            },
            {
                subdivistionName : "鹿児島県大隅",
                areas: ["鹿屋市","垂水市","曽於市","志布志市","大崎町","東串良町","錦江町","南大隅町","肝付町"],
                n : 174
            },
            {
                subdivistionName : "鹿児島県十島村",
                areas : ["鹿児島十島村"],
                n : 175
            },
            {
                subdivistionName : "鹿児島県甑島",
                areas : ["薩摩川内市甑島"],
                n : 176
            },
            {
                subdivistionName : "鹿児島県種子島",
                areas : ["西之表市","三島村","中種子町","南種子町"],
                n : 177
            },
            {
                subdivistionName : "鹿児島県屋久島",
                areas : ["屋久島町"],
                n : 178
            },
            {
                subdivistionName : "鹿児島県奄美北部",
                areas : ["奄美市","大和村","宇検村","瀬戸内町","龍郷町","喜界町"],
                n : 179
            },
            {
                subdivistionName : "鹿児島県奄美南部",
                areas: ["徳之島町","天城町","伊仙町","和泊町","知名町","与論町"],
                n : 180
            }
        ]
    },
    {
        pref : "沖縄県",
        Subdivisions : [
            {
                subdivistionName : "沖縄県本島北部",
                areas : ["名護市","国頭村","大宜味村","東村","今帰仁村","本部町","恩納村","宜野座村","金武町","伊江村","粟国村","伊平屋村","伊是名村"],
                n : 181
            },
            {
                subdivistionName : "沖縄県本島中南部",
                areas : ["那覇市","宜野湾市","浦添市","糸満市","沖縄市","豊見城市","うるま市","南城市","読谷村","嘉手納町","北谷町","北中城村","中城村","西原町","与那原町","南風原町","渡嘉敷村","座間味村","渡名喜村","八重瀬町"],
                n : 182
            },
            {
                subdivistionName : "沖縄県久米島",
                areas : ["久米島町"],
                n : 183
            },
            {
                subdivistionName : "沖縄県大東島",
                areas: ["南大東村","北大東村"],
                n :184
            },
            {
                subdivistionName : "沖縄県宮古島",
                areas : ["宮古島市","多良間村"],
                n : 185
            },
            {
                subdivistionName : "沖縄県石垣島",
                areas : ["石垣市"],
                n : 186
            },
            {
                subdivistionName : "沖縄県与那国島",
                areas : ["与那国町"],
                n : 187
            },
            {
                subdivistionName : "沖縄県西表島",
                areas : ["竹富町"],
                n : 188
            }
        ]
    }
]

export const SubDivisionsLatitude = [
    '43.4140196981624',
    '42.994157744658125',
    '42.84618308283292',
    '42.31311417072291',
    '41.8946230705069',
    '41.59306689695711',
    '42.130602359894546',
    '43.16710078792288',
    '42.8295192766729',
    '42.85060443806004',
    '42.16210643603938',
    '43.79542223295022',
    '43.50321927720144',
    '43.14646488600037',
    '44.371691585550394',
    '43.74035000431906',
    '43.19264436665243',
    '44.5152237984344',
    '43.9356345320833',
    '45.16360232668413',
    '44.84263748484812',
    '45.290386111979196',
    '43.86011809910126',
    '43.79189569936449',
    '44.1669042311665',
    '42.626485383965175',
    '42.67801961478722',
    '42.730101745448835',
    '42.502088121731035',
    '42.218652777779226',
    '43.359024978980855',
    '42.880986559019924',
    '42.521281316792575',
    '43.5384804776061',
    '43.20019458757639',
    '43.86301107808741',
    '43.42155586319326',
    '43.366790188956166',
    '40.89416504534065',
    '40.57398656083618',
    '40.60395462013106',
    '41.30418953912554',
    '39.844810311914976',
    '39.19661151346954',
    '39.929417161903956',
    '39.2182898176523',
    '38.73409572623581',
    '38.03022896411516',
    '38.39185113507765',
    '40.09810793899304',
    '39.45195690214556',
    '40.170197973797364',
    '39.436616227814085',
    '38.703701487986145',
    '38.77983970747924',
    '38.37101146937291',
    '38.00574535767346',
    '37.40250517657715',
    '37.38533633890514',
    '37.423155629592166',
    '36.56724051016283',
    '36.100327254123435',
    '36.85364447447675',
    '36.53375228031119',
    '36.70248335513197',
    '36.32546490178717',
    '36.122588084922356',
    '35.90184338580338',
    '35.98763190264805',
    '35.64861359778091',
    '35.68309117927697',
    '35.20890343885054',
    '35.66812388361732',
    '35.667237028663386',
    '35.7910854990455',
    '34.2115120532872',
    '34.736597734810374',
    '34.40830645602961',
    '34.016745816111644',
    '32.594146000110825',
    '26.27936844952873',
    '35.407957844187095',
    '35.419289071399604',
    '37.0015560890844',
    '37.22707967431174',
    '37.93403408909082',
    '38.062976668933594',
    '36.60630349228206',
    '36.600921225164186',
    '37.165068654426',
    '36.37628226176463',
    '35.94888873457917',
    '35.55044186562927',
    '35.62562601465109',
    '35.591842932296935',
    '36.67425371402741',
    '36.14402245918822',
    '35.67491664219022',
    '36.08357760035934',
    '35.47647869674208',
    '35.645908023853806',
    '34.88895804324638',
    '35.190839751242486',
    '35.14921951996496',
    '34.92913117926324',
    '34.903060181866806',
    '35.06162447248947',
    '35.01545060021379',
    '34.61843945164003',
    '34.20351610457925',
    '35.41285589847905',
    '35.034024937010855',
    '35.483070091249814',
    '35.019536362119545',
    '34.802123304112676',
    '34.43925038219843',
    '35.43841211843255',
    '34.91388085552355',
    '34.96504290040942',
    '34.37673635318788',
    '34.30460243982897',
    '34.09568863955189',
    '33.76885146412081',
    '35.38404129500548',
    '35.387174771421705',
    '35.29114956293046',
    '35.28340790044515',
    '34.77098700426666',
    '36.14918723406873',
    '35.09411757636774',
    '34.697163130804626',
    '34.788445334956855',
    '34.50003136081807',
    '34.316755257610815',
    '34.03314434961517',
    '33.77822624994084',
    '34.366241752671485',
    '34.23169109027324',
    '34.05465357096728',
    '33.781933071271354',
    '33.298084405693416',
    '33.52501875928274',
    '33.6180312589743',
    '33.09665670518522',
    '34.392313325092196',
    '34.117164348259045',
    '34.02015283991218',
    '34.1455254643489',
    '33.62965478613823',
    '33.76872274327631',
    '33.627211124457865',
    '33.249522938040805',
    '33.409647599162085',
    '33.23892725426812',
    '33.25371705984713',
    '32.86770414897458',
    '32.73103668698577',
    '34.38993290146133',
    '33.781070555246735',
    '32.87313084267668',
    '32.95183226563334',
    '32.718036326538375',
    '32.28544100598483',
    '32.35770288783889',
    '33.51217138053579',
    '33.219217226428725',
    '32.92964985893657',
    '33.15955319111721',
    '32.4538960231606',
    '32.48118222851707',
    '31.737100882302883',
    '31.915821590620176',
    '31.74851069933518',
    '31.404309384010613',
    '29.66689321326619',
    '31.774628570182987',
    '30.65057089344532',
    '30.37402583725418',
    '28.263044848495714',
    '27.552130830473093',
    '26.6728093037938',
    '26.268054843460668',
    '26.581879005381033',
    '25.885078331776285',
    '24.795634347688235',
    '24.53144192984102',
    '24.455400905281294',
    '24.303328951814674'
];
export const SubDivisionsLongitude = [
    '141.48864122300776',
    '141.26457595202777',
    '141.5173068925439',
    '140.24874823707523',
    '140.71631282936917',
    '140.18558725112365',
    '140.1219665121437',
    '140.78847221712962',
    '140.84447349941507',
    '140.35254127753032',
    '139.4802035112186',
    '141.95131765596918',
    '141.99596083909847',
    '141.91132325774964',
    '142.40093566617466',
    '142.65077863777555',
    '142.50315138366184',
    '141.8792093764835',
    '141.7379231587026',
    '141.95049865703209',
    '142.41936816911036',
    '141.11037054627624',
    '144.50910980300904',
    '143.64525979995165',
    '143.07200651473065',
    '140.89321440212137',
    '141.6512227836343',
    '142.43119782704014',
    '142.5968686655508',
    '142.99376984917646',
    '143.3120435291027',
    '143.2518307450022',
    '143.14037600357193',
    '144.41366808900366',
    '144.48472826730026',
    '145.0340435286804',
    '145.0694277487438',
    '145.74954097413885',
    '140.65901080518992',
    '140.3712777933173',
    '141.20865464548064',
    '141.11017971584567',
    '141.73666594347026',
    '141.7306982781256',
    '141.21053868318765',
    '141.177168997106',
    '141.14694954651318',
    '140.62075251401515',
    '141.16376733617957',
    '140.08472210164553',
    '140.2192815319253',
    '140.57920513188537',
    '140.56240284321836',
    '139.9033633416077',
    '140.2972931030225',
    '140.25738778280206',
    '139.96746802724812',
    '140.43698317730076',
    '140.80024953770192',
    '139.70457664907272',
    '140.43882760506608',
    '140.2380566804913',
    '139.791817513589',
    '139.83699500402923',
    '138.92439148007824',
    '139.08439108941468',
    '139.347259390643',
    '139.5341448529735',
    '138.96050412035288',
    '140.44265509250215',
    '140.11765670306596',
    '140.04582089617122',
    '139.7521345922302',
    '139.41785056795663',
    '139.1483754243677',
    '139.14341211090525',
    '139.39972002212392',
    '139.26237724156846',
    '139.54281365158684',
    '139.85790788356513',
    '142.38282338166636',
    '139.57718022948185',
    '139.16401290475324',
    '138.14076037915825',
    '138.90799493585178',
    '139.4246237383158',
    '138.3809138943442',
    '137.40408928235055',
    '136.94052392303573',
    '136.96222407275565',
    '136.64495213295453',
    '136.41975970179828',
    '135.8344553219899',
    '138.4949580609657',
    '138.88073337555142',
    '138.12207306698602',
    '138.1528982122556',
    '137.82069639589665',
    '137.18046921631034',
    '137.30977942989776',
    '136.71399361265438',
    '138.94649568064273',
    '138.78367502689895',
    '138.23562804960346',
    '137.8905848020192',
    '137.42868033114806',
    '137.092779964588',
    '136.51810783993133',
    '136.28322860559655',
    '136.4198964433086',
    '136.15994482019047',
    '136.11720600607137',
    '135.20374776259945',
    '135.68723368777924',
    '135.50859725908415',
    '135.38825051707136',
    '134.72571333016285',
    '135.12590993203167',
    '134.56650551207187',
    '134.84319045916365',
    '135.8709613211748',
    '135.32992506892273',
    '135.69050678161665',
    '134.23633690981652',
    '133.80354078534538',
    '133.3665346514448',
    '132.94539654554666',
    '132.19411771131078',
    '133.13964499758663',
    '133.8544844037572',
    '133.8562476139585',
    '132.74634041277253',
    '133.17399112895077',
    '132.54326455266246',
    '134.2104256698741',
    '134.38594316962346',
    '134.17489141741854',
    '133.7781828421469',
    '133.18304286544492',
    '132.800577223886',
    '132.51045126834993',
    '134.05728170025833',
    '133.50176241906584',
    '132.91238058180582',
    '131.32532312493615',
    '131.08327150872663',
    '132.13735615049896',
    '131.66570378765692',
    '130.37651544663865',
    '130.9010599774507',
    '130.74355528602865',
    '130.61570290119346',
    '129.92064562368924',
    '130.22407477263988',
    '129.66584307875092',
    '129.8201553277433',
    '130.2371257791725',
    '129.326806797966',
    '129.70871567133406',
    '128.92827868117124',
    '131.10852335439662',
    '130.76696861012252',
    '130.8607000873612',
    '130.29305593182755',
    '131.38167463266106',
    '131.61734065754015',
    '131.74275117008932',
    '131.15053210962697',
    '131.53206245683413',
    '131.25970808285894',
    '131.29951398431228',
    '131.04392919746832',
    '130.429893790694',
    '130.92582186594123',
    '129.66932421379155',
    '129.80603469481977',
    '130.7702953539211',
    '130.43917120836923',
    '129.41935560422957',
    '128.7718737891934',
    '127.9809513225852',
    '127.69274079109363',
    '126.99840083916979',
    '131.26907108162516',
    '125.19548259591335',
    '124.17353737725615',
    '122.9848907253411',
    '123.85056525076993'
];

globalThis.SubDivisionAndCityNames = SubDivisionAndCityNames